[{
  "_id": {
    "$oid": "67b4d21cdf20ae8783f89a7c"
  },
  "content": "Proposed fully insured program and monthly rates\nRate proposal for:\nItlize Global LLC\n©2022 Delta Dental of Connecticut\nDelta Dental of New Jersey\nDDCTNJ_Vision_Proposal110422\nOut-of-network allowances\nBenefits Covered up to Benefits Covered up to\nExamination $45 Lenticular lenses $100\nSingle vision lenses $30 Frame $70\nBifocal lenses $50 Elective contact\nlenses\n$105\nTrifocal lenses $65 Necessary contact\nlenses\n$210\nProgressive lenses $50\nAdditional savings\nBenefits Plan details\nFrames discount\nover allowance2\nAn extra $20 allowance on featured designer brands for frames. 20% savings on any amount above\nthe retail allowance.\nAdditional pair2 20% savings on unlimited additional pairs of prescription glasses and/or nonprescription sunglasses\nfrom any VSP provider within 12 months of exam.\nLASIK2\nAverage 15% off the regular price, or 5% off the promotional price; discounts only available from\ncontracted facilities.\nRetinal screening2 Routine retinal screening covered for a maximum fee of $39.\nLens coverage2 Glass or plastic single vision, lined bifocal, lined trifocal, or lenticular lenses are covered in full.3\nEssential Medical\nEyecare\nMedical exams and services for the diagnosis, evaluation, treatment, and management of chronic\nconditions such as diabetes, diabetic eye disease, glaucoma, and age-related macular degeneration\nPlan highlights Lens enhancements1\nBenefits Member cost\nPlan name DeltaVision-Essential Anti-glare coating $41 single/$41 multifocal\nNetwork Choice\nImpact-resistant\nlenses - adult\n$31 single/ $35 multifocal (covered\nfor children)\nExam/Lens/Frame\nfrequency\n(months)\n12/12/24\nContacts\nfrequency (in lieu\nof glasses)\n12\nProgressive lenses Standard Progressive lenses are\ncovered\nLight-reactive\nlenses\n$75 single vision/ $75 multifocal\nIn network coverage\nExam copay $10 Scratch-resistant\ncoating\n$17 single vision/$17 multi focal\nMaterials copay $25\nFrame allowance $130 (includes Walmart/Sam's\nClub)/ $70 Costco\nElective contact\nlens allowance\n$130\nNecessary contact\nlenses\nCovered in full after copay\nContact lens\nfit/eval\ncopayment\nUp to $60\nBoth frames and\ncontacts in the\nsame year\nNo; allows contacts in lieu of frames\nProposed fully insured program and monthly rates\nRate proposal for:\nItlize Global LLC\n©2022 Delta Dental of Connecticut\nDelta Dental of New Jersey\nDDCTNJ_Vision_Proposal110422\nTreatment for urgent conditions such as eye infections, foreign body and abrasions, eye injuries,\nand chemical exposure to the eye or eyelid\nMedical tests to diagnose and treat sudden changes in vision, such as eye flashes, floaters, and\nsudden vision loss. Other medical services to help support optimal vision and eye health for members\nexperiencing eye disorders or diseases.\nA standard $20 copay applies to medical exams only\nLow vision\n-approved low vision supplemental testing covered every two years.\ntesting) every two years.\nEyeconic®2 Go to Eyeconic.com for an easy-to-use, convenient online eyewear option.\nTruHearing®2\nSave up to 60% on hearing aids and batteries. Visit TruHearing.com/VSP or call 877.396.7194 for\nmore information.4\nRate Guarantee - Effective 2/1/2025\nDisclaimers and exclusions\nThe benefits outlined above are a summary of the quoted plan design. Full details on the plan of\nbenefits and applicable policy provisions, including limitations and exclusions, are provided in the group\ncontract.\n1Prices shown reflect the standard plastic price for each respective category. Premium lens\nenhancement prices may vary. Prices are valid only through VSP Choice Network Providers and are\nsubject to change without notice.\n2Available In Network only.\n3Covered in full materials and services are less any applicable copay. Based on applicable laws, benefits\nand savings may vary by location. Benefits may also vary at participating retail chains. Promotions like\nrebates are continually evaluated and subject to change without notice. In the state of Washington, VSP\nVision Care, Inc., is the legal name of the corporation through which VSP does business.\n4VSP is providing information to its members, but does not offer or provide any discount hearing\nprogram. The relationship between VSP and TruHearing is that of independent contractors. VSP makes\nno endorsement, representations, or warranties regarding any products or services offered by\nTruHearing, a third-party vendor. The vendor is solely responsible for the products or services offered\nby them. If you have any questions regarding the services offered here, you should contact the vendor\ndirectly."
}]