[{
  "_id": {
    "$oid": "67a3b03da3ecf6faabe76ab2"
  },
  "content": "To: Sub:\nLast Name, First Name Offer of Employment\nDate: MM/DD/YYYY\n1. Health Insurance\nMedical, Dental & Vision\n2. Paid Time off\n8 Days\n3. Paid Sick Day\n5 Days accrued over project hours\n4. Paid Federal Holiday\n6 Days\n$1,300 per month\n6. Relocation Exp\nUp to $1,200.00+ Flight Booking (If required) + First week Hotel+ Car rental (If required) with condition laid on above Compensation clause\nSALARY REVISIONS:\nA performance review along with a salary revision is applicable only on completion of 2080 hours on the project.\nRE-LOCATION EXPENSES:\nYou will receive re-location expenses up to a maximum of $1200 (depending on the project location, duration etc.) for every out-of-state project assignment. Additionally, the Company pays for One week of Hotel and Car rental/Taxi expenses. Receipts will be required for payment of such expenses.\nOTHER BENEFITS\nAfter one month from the start date of your project, you will be given an option to participate in Itlize’s medical, and dental, insurance, if you enroll in the insurance any time after 1st of a month your insurance will be effective from 1st of the following month. For Instance, if you become eligible on 3rd of September and chose to enroll in insurance, your request will be processed, and Insurance policy will be effective from 1st of October. While you are receiving\nDear :\nI am pleased to confirm our offer of employment to you with Itlize Global, LLC. (may be referred as “Itlize” or“Company” herein) as Microsoft Cloud Application Developer Consultant. You (may be referred as“Employee” herein) will be responsible for the design, development and/or administration of the systems and also participating in, customer software implementation projects. This employment agreement is designed to serve as a record of the essential terms and conditions of your employment, which, I trust, are in accordance with our discussions. This offer letter is valid from the first date of joining.\nCOMMENCEMENT OF EMPLOYMENT:\nSubject to your completion of your Bachelor’s/Master’s degree, your work permit (if applicable) and your joining.\nCOMPENSATION:\nAt the beginning of your project assignment with a client (On Project) you will be compensated as follows:\nAnnual Gross Salary: $60,000 per annum\n5. Off Project Stipend\nInitials\n| ItlizeGlobal, LLC. | 242 Old New Brunswick Road, Suite#250, Piscataway, NJ 08854| Phone: 732.529.6129 | Fax: 732.960.6242 |\nthe training stipend, your medical premium will be further subsidized to meet ACA requirement. In addition, you are eligible for 5 Sick days accrued over project hours and 8 days paid vacation after you complete 12 months on project with Clients of Itlize. These benefits will be detailed in our corporate policy document.\nItlize agrees to pay Employee and Employee agrees to accept from Itlize in full payment for the Employment compensation set forth in this Agreement. Compensation will be paid on a regular and periodic basis in accordance with the normal payroll procedures of Itlize, pro-rated for any partial pay period at the beginning & end of the Employment and subject to required withholding under applicable tax laws. Employee's compensation will cease upon termination of the Employment.\nItlize will reimburse Employee for all reasonable and necessary business expenses incurred by Employee in the Course of the Employment; to the extent the expenses are documented and consistent with the policies and procedures of Itlize.\nIn the event you terminate your employment with the Company by your resignation for any reason within eighteen\n(18) months of receiving a Company-paid benefit such as training, tuition reimbursement, seminars, compensation/performance based bonuses, relocation bonus/expenses, un-recovered advances against future salary, initial airfare, etc., the Company reserves the right to recover from you the full cost of such Company-paid benefit and to set off the cost of all or any portion of such Company-paid benefit against any amounts owed by the Company to you upon such termination of employment.\nDUTIES AND OBLIGATIONS:\nDuring the course of employment, Employee will be required to travel or relocate to any of the 50 states in US to perform onsite consulting services. Employee agrees to travel or relocate to any of the locations in the US as directed by Itlize. Employee will perform such duties as may be assigned from time to time by Itlize. Employee agrees to faithfully, industriously, and to the best of his/her ability, performs all the duties that may be required by the Employment. The Employee shall discharge the Employee’s responsibilities pursuant to this Agreement competently, carefully and faithfully. In performance of the Employee’s duties, the Employee shall comply with any and all of Itlize’s policies, rules, procedures and all applicable local, state and federal laws, rules, regulations, statutes, ordinances and other provisions of law and shall maintain a standard of professional conduct that is acceptable to Itlize.\nCONFLICT OF INTEREST:\nThe Employee represents that Employee is not in any way restricted from entering into this Agreement, including by prior or existing agreement with any other person or entity, and hereby agrees to indemnify, defend (including paying Itlize reasonable attorney’s fees and any and all other foreseeable costs) and hold Itlize harmless with respect to all claims and suits as a result of any such prior or existing agreement. Employee agrees during the term of Employment not to engage in, work for, assist or be associated with in any way, or have any interest in, any business which competes with Itlize, or any business which solicits customers and markets similar products in those areas in which Itlize currently does business.\nTERM AND TERMINATION:\nAt Will Employment: Itlize hereby employs employee, and employee hereby accepts employment on at-will basis. Employee and Company acknowledges that either party may terminate the employment relationship subject to Early termination (Section Below). Employee hereby agrees that his/her employment with the Company may be terminated at any time and for any reason, or for no reason. Should employee seek employment termination, the Company requires 2 weeks (10 working days) of advance notice.\nEarly Termination: The initial term of this Agreement shall be for 18 months commencing on the date the Employee arrives at Itlize and begins training (the “Commencement Date”), and expiring eighteen (18) months after the Commencement Date (the “Termination Date”) subject, however, to earlier termination as hereinafter provided.\nInitials\n| ItlizeGlobal, LLC. | 242 Old New Brunswick Road, Suite#250, Piscataway, NJ 08854| Phone: 732.529.6129 | Fax: 732.960.6242 |\nThe Employee acknowledges that Itlize has invested substantial time, money, efforts and resources in employing Employee. Employee understands that Itlize is depending on the Employee to implement projects with the clients and Itlize will suffer damages if Employee terminates the employment prior to the Term Date or the Termination Date. The Employee agrees that the liquidated damages amount is a reasonable forecast of the just compensation due to Itlize for Employee’s breach in which the monetary damages are difficult to assess accurately. The Employee agrees that if the Employee terminates this Agreement prior to the Termination Date or Term Date, the Employee will pay Itlize a sum of One Thousand Dollars ($1,000.00) for every month remaining on the Term Date or Termination Date, as a liquidated damages sum for the breach of this provision only, which is in addition to any other damages Itlize may seek for a breach of any other provision in this Agreement including but not limited to, the non-solicitation and non-competition provisions of this Agreement. Employee also agrees to pay all legal and administrative costs to Itlize in enforcing this agreement.\nIn the event of termination of this Agreement or of the Employee, each will continue to be liable for all portions of this Agreement that are to remain in effect following termination of this Agreement. Employee further agrees that within five (5) days after termination of the Employment, he/she will return to Itlize all equipment, documents, supplies, stationery, and any other property of Itlize, which Itlize furnished to him/her as well as all copies, or duplicates of the same. Upon receipt of such materials, Itlize will compensate Employee for all final Compensation and Commissions that may be owed Employee by Itlize within 45 calendar days. Itlize shall have the right to offset any amounts owed to Employee against any amounts owed to Itlize by Employee.\nCONFIDENTIAL AND PROPRIETARY INFORMATION:\nEmployee acknowledges that during the Employment (a) he/she will be privy to certain confidential and proprietary information, which constitutes trade secrets, and that (b) he/she will be privy to certain other confidential and proprietary information that may not constitute trade secrets. Employee acknowledges that Itlize must protect both the above kinds of information from disclosure or misappropriation, and Employee further acknowledges that the processes, Machines, technical documentation, computer programs, Customer lists, business plans, marketing Plans and techniques, pricing data, financial data, marketing programs, customer files, financial institutional files, technical expertise and know how, and other information and trade secrets (collectively the \"Property'), which have been or will be provided to Employee by Itlize, are unique, confidential and proprietary Property of Itlize and by the provision of such Property to Employee, Itlize is not conveying any ownership or other interest to Employee. Employee acknowledges that such confidential and Proprietary information derives independent, actual and potential Commercial value from not being generally, readily ascertainable through independent development and is the subject of efforts by Itlize that are reasonable under the circumstances to maintain its secrecy. Employee agrees to hold in trust & confidence for Itlize and to not to disclose to any third party without prior written Consent of Itlize, said Property and information, whether it is tangible or intangible. Employee further agrees not to use any such Confidential information or trade secrets to his/her persona] benefit or for the benefit. Employee also agrees to return to Itlize all such information and Property which is tangible upon the termination of the Employment.\nEmployee and Itlize agree that Employee's obligations under the above non-disclosure provision as it relates to confidential information that does not constitute trade secrets shall apply for a period of two (2) years following the termination of the Employment.\nNON-SOLICITATION:\nDuring the term of this agreement and for a period of 12 months after the termination of employment with Itlize, the Employee shall not directly or indirectly, either as an employee, contractor, agent, principle, partner, stockholder, officer or director or in any other capacity work for a client or client’s client of the Company for whom the Employee provided services while an employee of the Company.\nEmployee agrees during the one year period following the termination of the Employment, not to actively recruit, engage in passive hiring efforts, solicit or induce any person or entity who, was an employee, agent, representative or sales person of Itlize to leave or cease his or her employment or other relationship with Itlize for any reason whatsoever; or hire or engage the services of such person for employee in any business substantially similar to or competitive with that in which Itlize was engaged during the Employment.\nInitials\n| ItlizeGlobal, LLC. | 242 Old New Brunswick Road, Suite#250, Piscataway, NJ 08854| Phone: 732.529.6129 | Fax: 732.960.6242 |\nCONSENT TO INJUNCTION:\nIt is understood and agreed that a breach by Employee of these covenants will cause irreparable damages to Itlize and, therefore, the parties agree that in the event Employee breaches any of these covenants, Itlize shall he entitled to a grant of injunctive relief from a court of competent jurisdiction in addition to any and all other remedies allowed by law.\nINVENTIONS AND PATENTS:\nEmployee agrees that he/she will promptly fully disclose to Itlize all inventions, designs, improvements, ideas, programs, and discoveries which he/she now has or may hereafter have during the term of this Agreement which relate to the business of Itlize or to any experimental work carried on by Itlize, whether conceived or under development by Employee alone or with others and whether or not conceived during regular working hours. All such inventions, designs, improvements, and discoveries shall be the exclusive property of Itlize. Employee shall assist Itlize to obtain patents on all such inventions, designs, improvements, and discoveries deemed patent worthy by Itlize and shall execute all documents and do all things necessary to obtain letters. Patent, vest Itlize with full and exclusive title thereto, and protect the same against infringement by others.\nGOVERNING LAW:\nThis Agreement has been executed and delivered in and shall be interpreted, construed and enforced pursuant to and in accordance with the laws of the State of New Jersey, without effect through conflicts of law.\nThe waiver by either party of a breach or a violation of any provision of this Agreement shall not operate as, or be construed to be, a waiver or any subsequent breach of the same or other provision hereof.\nThe Employee and Itlize waive any and all rights they may have to a trial by jury against the other for any and all actions arising out of or related to this Agreement and the Employment including but not limited to claims for employment Discrimination under the New Jersey Law against Discrimination and any federal discrimination laws.\nIn case of any information furnished by you either in your application for employment or during the selection process is found to be incorrect/false, and/or if it is found that you have suppressed any material information in respect of your qualifications and past experience, Itlize reserves the right to terminate your services anytime without notice or compensation in lieu of notice.\nIn the event any provision or any part thereof of this Agreement is held to be unenforceable for any reason, such determination shall not affect the remainder of the provision or this Agreement, which shall remain in full force and effect and enforceable in accordance with its terms. In the event of the invalidity of a provision or any part thereof, the parties hereto hereby agree to accept a provision that reflects as closely as possible the intention of the invalid provision that does not offend any law. Furthermore, if there is any change in applicable law such that this Agreement is otherwise interpreted as violating applicable laws, rules or regulations, the parties will restructure this Agreement so that this Agreement is in compliance with existing laws and to the extent possible, the restructure Agreement will reflect the same substantiated terms as this Agreement.\nThis Agreement was the subject of review by both parties, with full opportunity to consult counsel. Accordingly, unless otherwise stated herein, any ambiguities herein shall not be interpreted against the interest of the party that drafted the Agreement or the alleged ambiguous provision.\nItlize does not discriminate in employment opportunities or practices on the basis of race, color, religion, sex, national origin, age, or any other characteristic protected by law. In accordance to the US employment eligibility laws, Itlize participates in the E-Verify Employment Verification Program.\nI would appreciate you indicating your acceptance of this offer by signing the enclosed copy of this letter in the space provided and returning it to me as soon as possible.\nInitials\n| ItlizeGlobal, LLC. | 242 Old New Brunswick Road, Suite#250, Piscataway, NJ 08854| Phone: 732.529.6129 | Fax: 732.960.6242 |\nI am certain that you will find a career with Itlize Global, LLC. to be both challenging and rewarding, and I look forward to you joining us.\nSincerely, Agreed to and accepted with the express\nFor Itlize Global, LLC. intent to be legally bound\nName: Name: First Name, Last Name\nOperations Manager Date: MM/DD/YYYY\nItlize Global, LLC. Date: MM/DD/YYYY"
}]